tutorials/old/movingMeshRhoPimpleFoam/rhoPimpleArbitraryFoamCyclic/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    sides
    {
        type            empty;
    }
    top
    {
        type            zeroGradient;
    }
    outlet
    {
        type            fixedValue;
        value           nonuniform List<vector> 
15
(
(-2.83274e-22 0 0)
(-2.83274e-22 0 0)
(-1.25324e-16 0 0)
(-7.50369e-12 0 0)
(-6.0803e-08 0 0)
(-6.66786e-05 0 0)
(-0.00989598 0 0)
(-0.198766 0 0)
(-0.540302 0 0)
(-0.198766 0 0)
(-0.00989598 0 0)
(-6.66786e-05 0 0)
(-6.0803e-08 0 0)
(-7.50369e-12 0 0)
(-1.25324e-16 0 0)
)
;
    }
    bottom
    {
        type            zeroGradient;
    }
    inlet
    {
        type            fixedValue;
        value           nonuniform List<vector> 
15
(
(-2.83274e-22 0 0)
(-2.83274e-22 0 0)
(-1.25324e-16 0 0)
(-7.50369e-12 0 0)
(-6.0803e-08 0 0)
(-6.66786e-05 0 0)
(-0.00989598 0 0)
(-0.198766 0 0)
(-0.540302 0 0)
(-0.198766 0 0)
(-0.00989598 0 0)
(-6.66786e-05 0 0)
(-6.0803e-08 0 0)
(-7.50369e-12 0 0)
(-1.25324e-16 0 0)
)
;
    }
}


// ************************************************************************* //
