tutorials/old/movingMeshRhoPimpleFoam/rhoPimpleArbitraryFoamCyclic/Allrun
#!/bin/sh                                                                                                                                                                                                                                     
# Source tutorial run functions                                                                                                                                                                                                               
. $WM_PROJECT_DIR/bin/tools/RunFunctions

# Get application name                                                                                                                                                                                                                        
application="rhoPimpleFoam"


runApplication blockMesh




runApplication paraFoam -touch
runApplication $application 
